xealits/msp430chip/examples/i2c_ti_example_clean.cpp
// Trying to repeat the following Ti example,
// but MSP430G2553 gets stuck on sending.
// It does process the TX interrupt once, i.e. writes to TX BUF.
// But it never receives the second interrupt, never sends the STOP condition,
// and never exits the LPM0 sleep.
// If I make it exit the sleep at the end of the first interrupt
// and add the stop condition, USC B never clears the stop condition flag.

//******************************************************************************
//  MSP430G2xx3 Demo - USCI_B0 I2C Master TX single bytes to MSP430 Slave
//
//  Description: This demo connects two MSP430's via the I2C bus. The master
//  transmits to the slave. This is the master code. It continuously
//  transmits 00h, 01h, ..., 0ffh and demonstrates how to implement an I2C
//  master transmitter sending a single byte using the USCI_B0 TX interrupt.
//  ACLK = n/a, MCLK = SMCLK = BRCLK = default DCO = ~1.2MHz
//
//  *** to be used with "msp430g2xx3_uscib0_i2c_07.c" ***
//
//                                /|\  /|\
//               MSP430G2xx3      10k  10k     MSP430G2xx3
//                   slave         |    |        master
//             -----------------   |    |  -----------------
//           -|XIN  P1.7/UCB0SDA|<-|---+->|P1.7/UCB0SDA  XIN|-
//            |                 |  |      |                 |
//           -|XOUT             |  |      |             XOUT|-
//            |     P1.6/UCB0SCL|<-+----->|P1.6/UCB0SCL     |
//            |                 |         |                 |
//
//  D. Dang
//  Texas Instruments Inc.
//  February 2011
//   Built with CCS Version 4.2.0 and IAR Embedded Workbench Version: 5.10
//******************************************************************************
#include <msp430.h>

unsigned char TXData = 0x00;
unsigned char TXByteCtr;

// 0x48 - Ti example
// 0x77 - my Grive BMP280 board
constexpr unsigned slave_address = 0x48;

void blink_code(unsigned code, unsigned bit_len) {
  unsigned min_len = (bit_len < sizeof(code) * 8 ? bit_len : sizeof(code) * 8);

  for (unsigned bit_i = 0; bit_i < min_len; bit_i++) {
    P1OUT &= ~BIT0; // P1.0 = 0
    __delay_cycles(200'000);

    P1OUT |= BIT0; // P1.0 = 1
    if ((code & (1 << (min_len - 1 - bit_i))) > 0) {
      __delay_cycles(1'000'000);
    }
    else {
      __delay_cycles(100'000);
    }
  }
}

int main(void)
{
  WDTCTL = WDTPW + WDTHOLD;                 // Stop WDT
  // blink red led on Launchpad
  P1OUT &= ~BIT0;                           // P1.0 = 0
  P1DIR |= BIT0;                            // P1.0 output

  P1SEL |= BIT6 + BIT7;                     // Assign I2C pins to USCI_B0
  P1SEL2|= BIT6 + BIT7;                     // Assign I2C pins to USCI_B0
  UCB0CTL1 |= UCSWRST;                      // Enable SW reset
  UCB0CTL0 = UCMST + UCMODE_3 + UCSYNC;     // I2C Master, synchronous mode
  UCB0CTL1 = UCSSEL_2 + UCSWRST;            // Use SMCLK, keep SW reset
  UCB0BR0 = 12;                             // fSCL = SMCLK/12 = ~100kHz
  UCB0BR1 = 0;
  UCB0I2CSA = slave_address;                // Slave Address is 048h
  UCB0CTL1 &= ~UCSWRST;                     // Clear SW reset, resume operation
  IE2 |= UCB0TXIE;                          // Enable TX interrupt

  TXData = 0x00;                            // Holds TX data

  blink_code(0b1111, 4);

  while (1)
  {
    TXByteCtr = 1;                          // Load TX byte counter
    while (UCB0CTL1 & UCTXSTP)              // Ensure stop condition got sent
    {
      // this loop is never entered
      // the stop condition was never set
      // because there was never a second interrupt to set it
      while (1) blink_code(0x1, 2);
    }

    blink_code(0b100001111, 8);

    UCB0CTL1 |= UCTR + UCTXSTT;             // I2C TX, start condition
    __bis_SR_register(CPUOFF + GIE);        // Enter LPM0 w/ interrupts
                                            // Remain in LPM0 until all data
                                            // is TX'd
    TXData++;                               // Increment data byte

    // it never wakes up from the sleep on the second loop iteration

    blink_code(0b1100, 4);
    blink_code(0b1100, 4);
  }
}

//------------------------------------------------------------------------------
// The USCIAB0TX_ISR is structured such that it can be used to transmit any
// number of bytes by pre-loading TXByteCtr with the byte count.
//------------------------------------------------------------------------------
#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector = USCIAB0TX_VECTOR
__interrupt void USCIAB0TX_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(USCIAB0TX_VECTOR))) USCIAB0TX_ISR (void)
#else
#error Compiler not supported!
#endif
{
  // blink to show that it handles the first interrupt
  blink_code(0b011010, 6);

  // clear the LED pin
  // in case it does not wake up from the sleep,
  // it is the only place where LED is cleared
  P1OUT &= ~BIT0; // P1.0 = 0

  if (TXByteCtr)                            // Check TX byte counter
  {
    UCB0TXBUF = TXData;                     // Load TX buffer
    TXByteCtr--;                            // Decrement TX byte counter

    // check whether there is a NACK at this point
    if (UCB0STAT & (UCNACKIFG) )
    {
      while (1) blink_code(0x0, 1);
    }
  }

  // this branch is never triggered - there is never a second interrupt
  // and the msp430g2553 never leaves the LPM0 sleep state
  // red LED remains ON
  else
  {
    while (1) blink_code(0x01, 2);

    UCB0CTL1 |= UCTXSTP;                    // I2C stop condition
    IFG2 &= ~UCB0TXIFG;                     // Clear USCI_B0 TX int flag
    __bic_SR_register_on_exit(CPUOFF);      // Exit LPM0
  }
}

